Smiles/app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "imagen", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-08-10 23:53:52.445446"], ["imagen", "<0 bytes of binary data>"], ["password", ""], ["updated_at", "2014-08-10 23:53:52.445446"], ["username", ""]]

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "password" = $1, "updated_at" = $2, "username" = $3 WHERE "usuarios"."id" = 1  [["password", "1234"], ["updated_at", "2014-08-10 23:54:18.267350"], ["username", "ronnyvaldivieso"]]